app/Controllers/CreateController.php

SELECT *
FROM `issues`
SELECT *
FROM `sub_types`
SELECT *
FROM `impacts`
---
    public function create()
    {
        $data = [
            'title' => 'Created',
            'validation' => \config\Services::validation(),
            'issues' => $this->db->table('issues')->get()->getResult(),
            'sub_types' => $this->db->table('sub_types')->get()->getResult(),
            'impacts' => $this->db->table('impacts')->get()->getResult(),