app/Controllers/EditController.php

SELECT *
FROM `cases`
---
    public function index()
    {
        $builder = $this->db->table('cases')
            ->get()->getResultArray();