app/Controllers/HomeController.php

SELECT DISTINCT `case`, `case_id`
FROM `tikets`
JOIN `cases` ON `tikets`.`case_id` = `cases`.`id`
SELECT DISTINCT `users`.`id`, `username`
FROM `tikets`
JOIN `users` ON `tikets`.`user_id` = `users`.`id`
SELECT DISTINCT `city_id`, `code_3lc`
FROM `tikets`
JOIN `cities` ON `tikets`.`city_id` = `cities`.`id`
---
    public function index()
    {
        $db      = \Config\Database::connect();
        $Pesan = new Pesan();


        $data = [
            'title' => 'Dashboard',
            'cases' => $this->Tiket->join('cases', 'tikets.case_id = cases.id')->select('case ,case_id')->distinct('case_id', 'case')->get()->getResult(),
            'users' => $this->Tiket->join('users', 'tikets.user_id = users.id')->select('users.id ,username')->distinct('users.id')->get()->getResult(),
            'origins' => $this->Tiket->join('cities', 'tikets.city_id = cities.id')->select('code_3lc')->distinct('code_3lc')->get()->getResult(),