app/Controllers/LogBookController.php

SELECT *
FROM `sub_types`
WHERE `issue_id` = '1'
---
    public function getSubType()
    {
        $id = $this->request->getVar('id');
        return json_encode($this->db->table('sub_types')->where('issue_id', $id)->get()->getResult());

SELECT *
FROM `descriptions`
WHERE `sub_type_id` IS NULL
---
    public function getDesc()
    {
        $id = $this->request->getVar('id');
        return json_encode($this->db->table('descriptions')
            ->where('sub_type_id', $id)->get()->getResult());