app/Controllers/LogBookController.php

SELECT *
FROM `logbooks`
JOIN `users` ON `logbooks`.`user_id` = `users`.`id`
JOIN `accounts` ON `logbooks`.`account_id` = `accounts`.`id`
ORDER BY `logbooks`.`created_at` DESC
---
    public function index()
    {
        $data = [
            'title' => 'Log Book',
            'notif' => $this->Pesan->notif(),
            'logs' => $this->LogBook->join('users', 'logbooks.user_id = users.id ')
                ->join('accounts', 'logbooks.account_id = accounts.id')