app/Controllers/MyTiketController.php

            'title' => 'Tiket',
            'validation' => \config\Services::validation(),
            'cases' => $this->Tiket->distinct()->findColumn('case_id'),
            'regionals' => $this->Tiket->distinct()->findColumn('regional'),
---
SELECT DISTINCT `regional`
FROM `tikets`
WHERE `tikets`.`deleted_at` IS NULL