app/Controllers/ShowlogbookController.php

SELECT *
FROM `categories`
SELECT *
FROM `issues`
SELECT *
FROM `impacts`
SELECT `sub_types`.*, `issues`.`name` as `issue`
FROM `sub_types`
JOIN `issues` ON `sub_types`.`issue_id` = `issues`.`id`
SELECT `descriptions`.*, `impacts`.`name` as `impact`, `sub_types`.`name` as `sub_type`
FROM `descriptions`
JOIN `sub_types` ON `descriptions`.`sub_type_id` = `sub_types`.`id`
JOIN `impacts` ON `descriptions`.`impact_id` = `impacts`.`id`
---
    public function index()
    {
//        dd();
        $data = [
            'title' => 'Show logBook',
            'validation' => \config\Services::validation(),
            'categories' => $this->db->table('categories')->get()->getResult(),
            'issues' => $this->db->table('issues')->get()->getResult(),
            'impacts' => $this->db->table('impacts')->get()->getResult(),
            'sub_types' => $this->db->table('sub_types')->join('issues', 'sub_types.issue_id = issues.id')->select('sub_types.*, issues.name as issue')->get()->getResult(),
            'descriptions' => $this->db->table('descriptions')
                ->join('sub_types', 'descriptions.sub_type_id = sub_types.id')
                ->join('impacts', 'descriptions.impact_id = impacts.id')
                ->select('descriptions.* ,impacts.name as impact, sub_types.name as sub_type')
                ->get()->getResult()