app/Controllers/TiketController.php

            'title' => 'Tiket',
            'validation' => \config\Services::validation(),
            'cases' => $this->Tiket->distinct()->findColumn('case_id'),
            'regionals' => $this->Tiket->distinct()->findColumn('regional'),
---
SELECT DISTINCT `regional`
FROM `tikets`
WHERE `tikets`.`deleted_at` IS NULL

    public function detail($id)
    {
        $builder = $this->Tiket
            ->join('cases', 'tikets.case_id = cases.id')
            ->where('tikets.tiket_id', $id);

        $query   = $builder->get()->getRowArray();
        $pesan = $this->Pesan
            ->select('pesan,messages.created_at,username,user_id,foto')
            ->join('users', 'users.id = messages.user_id')
            ->orderBy('messages.created_at', 'desc')
            ->where('tiket_id', $id)->findAll();
---
SELECT *
FROM `tikets`
JOIN `cases` ON `tikets`.`case_id` = `cases`.`id`
WHERE `tikets`.`tiket_id` = 'ccd22054-85f2-35ba-8edc-a6a0bc3b30b8'
SELECT `pesan`, `messages`.`created_at`, `username`, `user_id`, `foto`
FROM `messages`
JOIN `users` ON `users`.`id` = `messages`.`user_id`
WHERE `tiket_id` = 'ccd22054-85f2-35ba-8edc-a6a0bc3b30b8'
ORDER BY `messages`.`created_at` DESC