app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $user = $this->User->find();