app/Models/Pesan.php

SELECT `messages`.`id`, `tikets`.`user_id`, `tikets`.`tiket_id`, `pesan`, `users`.`username`, `messages`.`created_at`
FROM `messages`
JOIN `users` ON `messages`.`user_id` = `users`.`id`
JOIN `tikets` ON `tikets`.`tiket_id` = `messages`.`tiket_id`
LEFT JOIN `is_reads` ON `messages`.`id` = `is_reads`.`message_id`
WHERE `tikets`.`user_id` = '1'
AND `is_reads`.`read` IS NULL
ORDER BY `created_at` DESC
---
    public function notif()
    {
        $notif = $this->db->table('messages')
            ->select('messages.id,tikets.user_id, tikets.tiket_id , pesan,users.username,messages.created_at')
            ->join('users', 'messages.user_id = users.id')
            ->join('tikets', 'tikets.tiket_id = messages.tiket_id')
            ->join('is_reads', 'messages.id = is_reads.message_id', 'left')
            ->where('tikets.user_id', session('id'))
            ->where('is_reads.read', NULL)
            ->orderBy('created_at', 'desc')
            ->get()->getResult();