app/Models/Tiket.php

    public function Search($id)
    {

        $builder = $this->db->table('tikets')
            ->where('tiket_id', $id);

        $query = $builder->get()->getRowArray();
---
SELECT *
FROM `tikets`
WHERE `tiket_id` = 'ccd22054-85f2-35ba-8edc-a6a0bc3b30b8'

    public function Edit($id)
    {
        $data = [
            'status' => 'PROGRESS'
        ];
        $this->db->table('tikets')
            ->update($data, ['tiket_id' => $id]);
---
UPDATE `tikets` SET `status` = 'PROGRESS'
WHERE `tiket_id` = 'ccd22054-85f2-35ba-8edc-a6a0bc3b30b8'